Script started on 2022-04-26 22:44:05-10:00 [TERM="xterm-256color" TTY="/dev/pts/1" COLUMNS="383" LINES="57"]
]0;craig@deathstar-02: ~/Git/perl_web_scraper[01;32mcraig@deathstar-02[00m:[01;34m~/Git/perl_web_scraper[00m$ exit./opieca6out.pl perl opieca6.pl .
loading:   mark.html
completed: mark.html
loading:   imdb.html
completed: imdb.html
]0;craig@deathstar-02: ~/Git/perl_web_scraper[01;32mcraig@deathstar-02[00m:[01;34m~/Git/perl_web_scraper[00m$ perl opieca6.pl .exit[K./opieca6out.pl 
Welcome to SWI-Prolog (threaded, 64 bits, version 8.4.2)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- top([is, it, true, that, mark, hamill, acts, in, star, wars, iv[67G][8G[68G[68G)[7G[69G.
Yes, thats true.
[1mtrue [0m[1m.[0m

?- top([who, acts, in, star, wars, iv[38G][8G[39G[39G)[7G[40G.
The person youre looking for is mark_hamill
[1mtrue [0m[1m.[0m

?- top([did, mark, hamill, play, luke, skywalker[49G][8G[50G[50G)[7G[51G.
Yes, thats true.
[1mtrue [0m[1m.[0m

?- top([mark, hamill, plays, luke, skywalker, right[52G][8G[53G[53G)[7G[54G.
Yes, thats true.
[1mtrue [0m[1m.[0m

?- top([did, mark, hamill, play, han, solo, in, star, wars, iii[64G][8G[65G[65G)[7G[66G.
Sorry, thats false.Sorry, thats false.
[1;31mfalse.[0m

?- top([did, mark, hamill, direct, star, wars, i[49G][8G[50G[50G)[7G[51G.
Sorry, thats false.Sorry, thats false.
[1;31mfalse.[0m

?- top([is, it, true, that, mark, hamill, is, an, actor[56G][8G[57G[57G)[7G[58G.
Yes, thats true.
[1mtrue [0m[1m.[0m

?- top([is, it, true, that, han, solo, is, a, character, in, star, wars, iii[77G][8G[78G[78G)[7G[79G.
Sorry, thats false.
[1;31mfalse.[0m

?- top([is, it, true, that, princess, leia, is, an, actor, and, mark, hamill, is, a, director[94G][8G[95G[95G)[7G[96G.
[1;31mfalse.[0m

?- top([george, lucas, is, a, director, and, mark, hamill, is, an, actor, and, han, solo, is, a, character, right[114G][8G[115G[115G)[7G[116G.
Sorry, thats false.Sorry, thats false.
[1;31mfalse.[0m

?- top([who, is, the, actor, for, han, solo[44G][8G[45G[45G)[7G[46G.
The person youre looking for is harrison_ford
[1mtrue [0m[1m.[0m

?- top([what, is, the, title, of, star, wars, ii[49G][8G[50G[50G)[7G[51G.
Youre looking for attack_of_the_clones
[1mtrue [0m[1m.[0m

?- top([who, is, the, director, of, star, wars, ii[51G][8G[52G[52G)[7G[53G.
The person youre looking for is george_lucas
[1mtrue [0m[1m.[0m

?- top([who, is, the, character, of, mark, hamill[50G][8G[51G[51G)[7G[52G.
The person youre looking for is luke_skywalker
[1mtrue [0m[1m.[0m

?- halt.
]0;craig@deathstar-02: ~/Git/perl_web_scraper[01;32mcraig@deathstar-02[00m:[01;34m~/Git/perl_web_scraper[00m$ exit
exit

Script done on 2022-04-26 22:45:56-10:00 [COMMAND_EXIT_CODE="0"]
